blog_src/org/2011-06-25-the-price-effect-of-banning-jace-and-stoneforge-mystic-in-standard.org
#+TITLE: The Price Effect Of Banning Jace And Stoneforge Mystic In Standard
#+AUTHOR: Ben
#+DATE: 2011-06-25
#+TAGS: data-science

A few days ago, [[http://mtg.throwingbones.com/card/33477][Jace, the Mind Sculptor]] and [[http://mtg.throwingbones.com/card/33287][Stoneforge Mystic]] were banned by Wizards. What is unexpected is that the price for a [[http://mtg.throwingbones.com/card/33372][Foil Jace]] is still high, close to $200. This may be because the are not many for sale, so their value remains high, or it may be a delayed effect of the banning, we will have to watch and see.

Jace is used in other formats, so his price may stay stable, but you can see both the [[http://mtg.throwingbones.com/card/33287][Stoneforge Mystic]] and [[http://mtg.throwingbones.com/card/33432][Foil Stoneforge Mystic]] are down since June 19th (46% and 30%, respectively)
