ben/blog/2011-06-25-the-price-effect-of-banning-jace-and-stoneforge-mystic-in-standard.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Price Effect Of Banning Jace And Stoneforge Mystic In Standard</title>
<meta name="author" content="Ben" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Price Effect Of Banning Jace And Stoneforge Mystic In Standard</h1>
<p><strong>Tags:</strong> <span class="tags"><a href="tags/data-science.html">data-science</a></span></p>

<p>
A few days ago, <a href="http://mtg.throwingbones.com/card/33477">Jace, the Mind Sculptor</a> and <a href="http://mtg.throwingbones.com/card/33287">Stoneforge Mystic</a> were banned by Wizards. What is unexpected is that the price for a <a href="http://mtg.throwingbones.com/card/33372">Foil Jace</a> is still high, close to $200. This may be because the are not many for sale, so their value remains high, or it may be a delayed effect of the banning, we will have to watch and see.
</p>

<p>
Jace is used in other formats, so his price may stay stable, but you can see both the <a href="http://mtg.throwingbones.com/card/33287">Stoneforge Mystic</a> and <a href="http://mtg.throwingbones.com/card/33432">Foil Stoneforge Mystic</a> are down since June 19th (46% and 30%, respectively)
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2011-06-25</p>
<p class="author">Author: Ben</p>
</div>
</body>
</html>
